README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>README</title>
<!-- 2018-03-23 Fr 11:41 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Yurii Malitskyi" />
</head>
<body>
<div id="content">
<h1 class="title">README</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">About</h2>
<div class="outline-text-2" id="text-1">
<p>
This is a supplementary code (in Python 3.6) for the paper Y. Malitsky
"Golden ratio algorithms for variational inequalities"
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Usage</h2>
<div class="outline-text-2" id="text-2">
<p>
There are 4 folders, each dedicated to its own problem: nash
equilibrium, convex feasibility problem, sparse logistic regression
and nonmonotone problem
</p>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">Nash equilibrium</h3>
<div class="outline-text-3" id="text-2-1">
<p>
There two ways to run this problem. First, using <code>.ipynb</code> file you can
run one random instance of the problem. It is convenient, as you can
see all formulas and plot together in one html file. Or you can run
<code>nash.py</code> which generates 10 random instances (as in the paper) and
saves the plot to <code>figures</code> folder.
</p>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2">Feasibility problem</h3>
<div class="outline-text-3" id="text-2-2">
<p>
This folder contains in fact two independent problems, which
demonstrate how GRAAL can accelerate the well-known simultaneous
projection method. The first problem is the tomography reconstruction of the Shepp-Logan phantom from the observed noisy sinogram. This problem is in the jupyter notebook <code>Tomography_reconstruction.ipynb</code> file. The notebook is self-contained. The
second problem is synthetic: it compares EGRAAL and the projection simultaneous method  for a convex feasibility problem with randomly generated balls. For one instance you can use Jupyter notebook <code>Convex feasibility problem for random balls.ipynb</code> and for running this problem over many random instances, use a python script <code>convex_feasibility_problem_for_random_balls.py</code>.
</p>
</div>
</div>


<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3">Sparse logistic regression</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Folder <code>data</code> contains several datasets from <a href="https://www.csie.ntu.edu.tw/~cjlin/libsvm/">LIBSVM</a> library, you can
download any others as well. In order to read these files, we use
<code>sklearn</code> library. In the beginning of <code>sparse_logistic_regression.py</code>
choose one of these datasets and run the script. It will generate the
plots in <code>figures/</code> folder.
</p>
</div>
</div>

<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4">Nonmonotone problems</h3>
<div class="outline-text-3" id="text-2-4">
<p>
There are two scripts <code>nonmonotone_F.py</code> and <code>nonmonotone_T.py</code>. The
first considers the problem of finding a zero of a given nonmonotone
operator \(F\) and the seconds finds an invariant unit direction vector
\(x\) of a given operator \(\tilde T\) that is \(x\) with \(\|x\|=1\) such
that \(\tilde Tx = \alpha x\) for some \(\alpha \neq 0\).
</p>
</div>
</div>
</div>
</div>
</body>
</html>
